# write_json.py
import json

data = {
    "Скрипник": ["Микита", "Олексійович", 2004],
    "Іваненко": ["Марія", "Петрівна", 2003],
    "Шевченко": ["Тарас", "Григорович", 1814],
    "Ковальчук": ["Іван", "Іванович", 1999],
    "Бондаренко": ["Олег", "Володимирович", 2001],
    "Гончар": ["Наталія", "Сергіївна", 2002],
    "Мельник": ["Андрій", "Олексійович", 2004],
    "Захаренко": ["Віктор", "Павлович", 2000],
    "Єфремов": ["Дмитро", "Олегович", 1998],
    "Їжак": ["Олена", "Ігорівна", 2006]
}

# Запис у файл з українським текстом
with open("people.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=4)

print(" Дані збережено у файл people.json (UTF-8)")